СсылочныеТипыДанных/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Тип</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

СсылочныеТипыДанных/Catalogs/Контрагенты/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Тип = Перечисления.Тип.ЮридическоеЛицо;
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ЭтоЮридическоеЛицо = (Тип = ПредопределенноеЗначение("Перечисление.Тип.ЮридическоеЛицо"));
	ЭтоФизическоеЛицо = (Тип = ПредопределенноеЗначение("Перечисление.Тип.ФизическоеЛицо"));
	Если ЭтоЮридическоеЛицо Тогда
		Если ЗначениеЗаполнено (ИНН) И ЗначениеЗаполнено (КПП) Тогда
			Если СтрДлина(ИНН)<> 10 ИЛИ СтрДлина (КПП) <> 9 Тогда
				Сообщить ("Некорректно заполнены ИНН или КПП!");
				Отказ = Истина;
			КонецЕсли;
		Иначе
			Сообщить ("Реквизиты ИНН или КПП не заполнены!");
			Отказ = Истина;
		КонецЕсли;
		Для Сч = 1 По СтрДлина (КПП) Цикл
			СимволКПП = Сред (КПП,Сч,1); 
			КодСимволаКПП = КодСимвола (СимволКПП);
			Если КодСимволаКПП <48 Или КодСимволаКпп> 57 Тогда
				Сообщить("Обнаружен запрещенный символ в КПП: "+ СимволКПП);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
